# StairsTopLowerThanBaseFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsTopLowerThanBaseFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The top of the Stair is lower than the base of the Stair
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsTopLowerThanBaseFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsTopLowerThanBaseFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsTopLowerThanBaseFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace